WELCOME_STRING = '\
██╗░░░██╗██╗░░██╗███╗░░░███╗░█████╗░██╗██╗░░░░░███████╗██████╗░\n\
██║░░░██║██║░██╔╝████╗░████║██╔══██╗██║██║░░░░░██╔════╝██╔══██╗\n\
╚██╗░██╔╝█████═╝░██╔████╔██║███████║██║██║░░░░░█████╗░░██████╔╝\n\
░╚████╔╝░██╔═██╗░██║╚██╔╝██║██╔══██║██║██║░░░░░██╔══╝░░██╔══██╗\n\
░░╚██╔╝░░██║░╚██╗██║░╚═╝░██║██║░░██║██║███████╗███████╗██║░░██║\n\
░░░╚═╝░░░╚═╝░░╚═╝╚═╝░░░░░╚═╝╚═╝░░╚═╝╚═╝╚══════╝╚══════╝╚═╝░░╚═╝\
'

CHOICES = {
	"1": "РАССЫЛКА В ЛИЧНЫЕ СООБЩЕНИЯ",
	"2": "РАССЫЛКА ПО ГРУППАМ",
	"3": "ИНСТРУКЦИЯ ПО СОФТУ"
}

PATHS = {
	"tokens": "accounts/active.txt",
	"people": "deliver_to/people.txt",
	"groups": "deliver_to/groups.txt"
}

EXCEPTIONS_MESSAGES = {
	"[5]": "ОШИБКА АВТОРИЗАЦИИ",
	"[902]": "ЗАКРЫТЫ ЛИЧНЫЕ СООБЩЕНИЯ",
	"[936]": "СТРАНИЦА НЕ СУЩЕСТВУЕТ",
	"[27]": "ГРУППА ЗАБЛОКИРОВАНА",
	"[15]": "КОММЕНТАРИИ ДЛЯ ПОДПИСЧИКОВ",
	"[01]": "КОММЕНТАРИИ ЗАКРЫТЫ"
}

with open("README.txt", "r", encoding="utf-8") as file:
	GUIDE = file.read()

